# Reading & Writing Excel Files
To allow pandas to read and write Excel files we would have to install the ***openpyxl*** and ***xlrd*** libraries<br>We don't need to import them afterwards

In [5]:
!pip3 install openpyxl

!pip3 install xlrd

Import the Pandas library

In [1]:
import pandas as pd

## Import Data From Excel Spreadsheet

In [2]:
file = pd.read_excel('Airline-Comparison.xlsx')
file.head()

   Period         Region    Revenue
0  FY2015         Africa   10000000
1  FY2015           Asia   20000000
2  FY2015      Australia   70000000
3  FY2015         Europe  120000000
4  FY2015  North America  150000000

### usecols
We can specify the columns we need from the spreadsheet by using index numbers

In [4]:
file = pd.read_excel('Airline-Comparison.xlsx', usecols=[1,2])
file.head()

          Region    Revenue
0         Africa   10000000
1           Asia   20000000
2      Australia   70000000
3         Europe  120000000
4  North America  150000000

We can use the letters of the collumns in the document as well.<br/>
Casing doesn't matter in this case

In [13]:
file = pd.read_excel('Airline-Comparison.xlsx', usecols='B')
file.head()

          Region
0         Africa
1           Asia
2      Australia
3         Europe
4  North America

When using letters we don't use a list notation. Instead we can put multiple values in a single string

In [15]:
file = pd.read_excel('Airline-Comparison.xlsx', usecols='a, b, c')
file.head()

   Period         Region    Revenue
0  FY2015         Africa   10000000
1  FY2015           Asia   20000000
2  FY2015      Australia   70000000
3  FY2015         Europe  120000000
4  FY2015  North America  150000000

When using this syntax we can even define ranges of columns<br/>
In this example I'm asking to get columns A through C and also column F and column K

In [17]:
file = pd.read_excel('Airline-Comparison.xlsx', usecols='a:c, f,k')
file.head()

   Period         Region    Revenue
0  FY2015         Africa   10000000
1  FY2015           Asia   20000000
2  FY2015      Australia   70000000
3  FY2015         Europe  120000000
4  FY2015  North America  150000000

### sheet_name
By default pandas will grab the first tab in the spreadsheet but we can also specify the name of the tab we need

In [9]:
file = pd.read_excel('Airline-Comparison.xlsx', sheet_name='Airline2')
file.head()

     Year     Region    Revenue
0  FY2015     Africa   15000000
1  FY2015       Asia  100000000
2  FY2015  Australia   50000000
3  FY2015     Europe   40000000
4  FY2016     Africa   10500000

We can also use numbers to specify position of the tab in the file

In [10]:
file = pd.read_excel('Airline-Comparison.xlsx', sheet_name=1)
file.head()

     Year     Region    Revenue
0  FY2015     Africa   15000000
1  FY2015       Asia  100000000
2  FY2015  Australia   50000000
3  FY2015     Europe   40000000
4  FY2016     Africa   10500000

If we need all of the tabs we can use the ***sheet_name*** parameter with the value 'None'.<br>This will generate a list, containing all the tabs in the original Excel file.

In [26]:
file = pd.read_excel('Airline-Comparison.xlsx', sheet_name=None)
file

OrderedDict([('Airline1',     Period         Region    Revenue
              0   FY2015         Africa   10000000
              1   FY2015           Asia   20000000
              2   FY2015      Australia   70000000
              3   FY2015         Europe  120000000
              4   FY2015  North America  150000000
              5   FY2015  South America   60000000
              6   FY2016         Africa    8000000
              7   FY2016           Asia   16000000
              8   FY2016      Australia   56000000
              9   FY2016         Europe   96000000
              10  FY2016  North America  120000000
              11  FY2016  South America   48000000),
             ('Airline2',    Period     Region    Revenue
              0  FY2015     Africa   15000000
              1  FY2015       Asia  100000000
              2  FY2015  Australia   50000000
              3  FY2015     Europe   40000000
              4  FY2016     Africa   10500000
              5  FY2016       Asia   70000000
              6  FY2016  Australia   35000000
              7  FY2016     Europe   28000000),
             ('Airline3',   Airline 3 Unnamed: 1 Unnamed: 2
              0       NaN        NaN        NaN
              1       NaN        NaN        NaN
              2    Period     Region    Revenue
              3    FY2015       Asia   20000000
              4    FY2016     Africa   15000000
              5    FY2016       Asia    5500000
              6    FY2016     Africa   35000000)])

To access each individual dataframe we can refer to specific positions inside the list

In [17]:
file['Airline2']

     Year     Region    Revenue
0  FY2015     Africa   15000000
1  FY2015       Asia  100000000
2  FY2015  Australia   50000000
3  FY2015     Europe   40000000
4  FY2016     Africa   10500000
5  FY2016       Asia   70000000
6  FY2016  Australia   35000000
7  FY2016     Europe   28000000

### skiprows
The third tab of this file is not structured idealy for pandas

In [30]:
pd.read_excel('Airline-Comparison.xlsx', sheet_name='Airline3')

  Airline 3 Unnamed: 1 Unnamed: 2
0       NaN        NaN        NaN
1       NaN        NaN        NaN
2    Period     Region    Revenue
3    FY2015       Asia   20000000
4    FY2016     Africa   15000000
5    FY2016       Asia    5500000
6    FY2016     Africa   35000000

The actual header is located in the 3rd row. We can use the ***skiprows*** parameter to get to it (3 is the number of rows we want to skip)

In [31]:
pd.read_excel('Airline-Comparison.xlsx', sheet_name='Airline3', skiprows=3)

   Period  Region   Revenue
0  FY2015    Asia  20000000
1  FY2016  Africa  15000000
2  FY2016    Asia   5500000
3  FY2016  Africa  35000000

### header
Alternatly, we can use ***header*** to define the 3rd row as the header of this document

In [32]:
pd.read_excel('Airline-Comparison.xlsx', sheet_name='Airline3', header=3)

   Period  Region   Revenue
0  FY2015    Asia  20000000
1  FY2016  Africa  15000000
2  FY2016    Asia   5500000
3  FY2016  Africa  35000000

## Export to xlsx file
### Export a single dataframe to a single tab
First, let's connect the first two tabs together

In [17]:
file = pd.read_excel('Airline-Comparison.xlsx', sheet_name=['Airline1','Airline2'])
flights = pd.concat(file, keys = ['Airline1','Airline2'])
flights

             Period         Region    Revenue
Airline1 0   FY2015         Africa   10000000
         1   FY2015           Asia   20000000
         2   FY2015      Australia   70000000
         3   FY2015         Europe  120000000
         4   FY2015  North America  150000000
         5   FY2015  South America   60000000
         6   FY2016         Africa    8000000
         7   FY2016           Asia   16000000
         8   FY2016      Australia   56000000
         9   FY2016         Europe   96000000
         10  FY2016  North America  120000000
         11  FY2016  South America   48000000
Airline2 0   FY2015         Africa   15000000
         1   FY2015           Asia  100000000
         2   FY2015      Australia   50000000
         3   FY2015         Europe   40000000
         4   FY2016         Africa   10500000
         5   FY2016           Asia   70000000
         6   FY2016      Australia   35000000
         7   FY2016         Europe   28000000

We are interested in exporting only rows for 2015.<br>The easiest way to do so will be to simply use the ***to_excel*** method

In [38]:
flights[flights['Period'] == 'FY2015'].to_excel('2015_data.xlsx')

            Period         Region    Revenue
Airline1 0  FY2015         Africa   10000000
         1  FY2015           Asia   20000000
         2  FY2015      Australia   70000000
         3  FY2015         Europe  120000000
         4  FY2015  North America  150000000
         5  FY2015  South America   60000000
Airline2 0  FY2015         Africa   15000000
         1  FY2015           Asia  100000000
         2  FY2015      Australia   50000000
         3  FY2015         Europe   40000000

### Create a file with multiple tabs
If we want to create a file with several tabs, we need to lay the foundation first (create an excel object)

In [7]:
excel_file = pd.ExcelWriter('New_File.xlsx')

Now we can define each individual tab, first let's create seperate dataframes for each year

In [8]:
flights_2015 = flights[flights['Period'] == 'FY2015']
flights_2016 = flights[flights['Period'] == 'FY2016']

Now we can export each of them to a new tab in our soon-to-be-created file. We can ommit the index by setting the ***index*** parameter to "False"

In [14]:
flights_2015.to_excel(excel_file, index = False, sheet_name='2015')

We can choose to export only some of the columns in the dataframe

In [15]:
flights_2016.to_excel(excel_file, columns=['Region','Revenue'], sheet_name='2016')

Finally, lat's save the excel object we created to actually export the data (the file is not created on our computer prior to this step)

In [16]:
excel_file.save()

### Use A Loop To Export Each Group To A Different Tab

In [28]:
file = pd.ExcelWriter('Flights_By_Region.xlsx')

In [21]:
regions = flights['Region'].unique()
regions

array(['Africa', 'Asia', 'Australia', 'Europe', 'North America',
       'South America'], dtype=object)

In [29]:
for region in regions:
    df = flights[flights['Region'] == region]
    df.to_excel(file, index=False, sheet_name = region)
file.save()